Polish diagram
Signed-off-by: guillemdb <guillem@fragile.tech>
